---
type: IControllableDropHandler
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# IControllableDropHandler

`Autodesk.Revit.UI.IControllableDropHandler` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CanExecute | — | `bool CanExecute ( UIDocument document , Object data , ElementId dropViewId )` |